# 28 -  Mengenal explode dan implode List pada Pandas Data Frame

# Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

1.2.4

# Persiapan Data Frame

In [4]:
d = {'Team':['DC' ,'Marvel'],
       'Heroes':[['Batman','Superman','Wonder Woman','Aquaman','Green Lantern','Shazam'],
    ['Ironman','Captain America','Ant-Man','Black Panther','Captain Marvel']]}
df = pd.DataFrame(d)
df

     Team                                             Heroes
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Ironman, Captain America, Ant-Man, Black Pant...

# Explode

fungsi explode ini akan meledakan data frame sebelumnya sehingga membentuk data frame baru

In [5]:
df1 = df.explode('Heroes')
df1

     Team           Heroes
0      DC           Batman
0      DC         Superman
0      DC     Wonder Woman
0      DC          Aquaman
0      DC    Green Lantern
0      DC           Shazam
1  Marvel          Ironman
1  Marvel  Captain America
1  Marvel          Ant-Man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

# Implode

fungsi ini untuk menyatukan data frame yang telah di explode

In [6]:
d = {'Team':['DC','Marvel']}
df2 = pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

jika dilakukan pengelompokkan

In [7]:
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

     Team                                           Imploded
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Ironman, Captain America, Ant-Man, Black Pant...